## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                  NAME                   |
|--------|-----------------------------------------|
| add    | `aws_quicksight_group.dataset_viewer`   |
| delete | `aws_quicksight_data_set.notifications` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_quicksight_data_set.notifications will be destroyed
  # (because aws_quicksight_data_set.notifications is not in configuration)
  - resource "aws_quicksight_data_set" "notifications" {
      - arn            = "arn:aws:quicksight:ca-central-1:239043911459:dataset/notifications" -> null
      - aws_account_id = "239043911459" -> null
      - data_set_id    = "notifications" -> null
      - id             = "239043911459,notifications" -> null
      - import_mode    = "SPICE" -> null
      - name           = "Notifications" -> null
      - output_columns = [
          - {
              - description = ""
              - name        = "id"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "template_id"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "template_version"
              - type        = "INTEGER"
            },
          - {
              - description = ""
              - name        = "service_id"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "job_id"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "notification_type"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "notification_status"
              - type        = "STRING"
            },
          - {
              - description = ""
              - name        = "created_at"
              - type        = "DATETIME"
            },
          - {
              - description = ""
              - name        = "sent_at"
              - type        = "DATETIME"
            },
          - {
              - description = ""
              - name        = "updated_at"
              - type        = "DATETIME"
            },
        ] -> null
      - tags           = {} -> null
      - tags_all       = {} -> null

      - data_set_usage_configuration {
          - disable_use_as_direct_query_source = false -> null
          - disable_use_as_imported_source     = false -> null
        }

      - logical_table_map {
          - alias                = "notifications" -> null
          - logical_table_map_id = "notifications" -> null

          - source {
              - physical_table_id = "notifications" -> null
            }
        }

      - permissions {
          - actions   = [
              - "quicksight:DescribeDataSet",
              - "quicksight:DescribeDataSetPermissions",
              - "quicksight:DescribeIngestion",
              - "quicksight:DescribeRefreshSchedule",
              - "quicksight:ListIngestions",
              - "quicksight:ListRefreshSchedules",
              - "quicksight:PassDataSet",
            ] -> null
          - principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-full-access" -> null
        }
      - permissions {
          - actions   = [
              - "quicksight:CancelIngestion",
              - "quicksight:CreateIngestion",
              - "quicksight:DeleteDataSet",
              - "quicksight:DescribeDataSet",
              - "quicksight:DescribeDataSetPermissions",
              - "quicksight:DescribeIngestion",
              - "quicksight:ListIngestions",
              - "quicksight:PassDataSet",
              - "quicksight:UpdateDataSet",
              - "quicksight:UpdateDataSetPermissions",
            ] -> null
          - principal = "arn:aws:quicksight:ca-central-1:239043911459:user/default/AWSReservedSSO_AWSAdministratorAccess_4085b2fdb6f29f43/stephen.astels@cds-snc.ca" -> null
        }

      - physical_table_map {
          - physical_table_map_id = "notifications" -> null

          - relational_table {
              - data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging" -> null
              - name            = "notifications" -> null

              - input_columns {
                  - name = "id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "template_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "template_version" -> null
                  - type = "INTEGER" -> null
                }
              - input_columns {
                  - name = "service_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "job_id" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "notification_type" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "notification_status" -> null
                  - type = "STRING" -> null
                }
              - input_columns {
                  - name = "created_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "sent_at" -> null
                  - type = "DATETIME" -> null
                }
              - input_columns {
                  - name = "updated_at" -> null
                  - type = "DATETIME" -> null
                }
            }
        }
    }

  # aws_quicksight_group.dataset_viewer will be created
  + resource "aws_quicksight_group" "dataset_viewer" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + description    = "users with viewer access to Quicksight data sets"
      + group_name     = "quicksight-dataset-viewer-access"
      + id             = (known after apply)
      + namespace      = "default"
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

24 tests, 17 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
